# üêº Pandas in Python

**Created by**: [@adigasuhas](https://github.com/adigasuhas)  
**Contact**: suhasadiga@jncasr.ac.in

---

Welcome! üôå  
This notebook is part of the **Python4MS** tutorial series, carefully crafted to teach **Python from scratch** ‚Äî in a simple, clear, and beginner-friendly way.  
We‚Äôll be using examples especially relevant to **Materials Science üî¨** to make learning both practical and engaging.

Python is one of the most popular and versatile programming languages today. Whether you're:

- analyzing data üìä
- automating repetitive tasks üîÅ
- or running scientific simulations üßÆ

‚Äî Python is becoming an essential tool in modern research.

---

## üìò What You'll Learn in This Notebook

In this notebook, you'll explore:

- ‚ú® **How to perform data manipulation and analysis using Pandas**
- üìä Learn how to create a DataFrame and analyze data relevant for machine learning & materials science applications.

---

> üìù **Note**: This tutorial assumes **no prior programming experience**.  
> Each concept is introduced step-by-step with simple explanations, real-world analogies, and hands-on examples.

Let's get started! üöÄ

## üêº Pandas ‚Äî Your Data Analysis Superpower!

**Pandas** is a powerful software library written for the Python programming language, specifically designed for **data manipulation and analysis**.  
It offers versatile data structures and rich operations for working with:

- numerical tables üìä
- labeled data üìã
- time series data ‚è≥

The name **Pandas** is derived from *"panel data"*, an econometrics term referring to datasets that include observations over multiple time periods for the same individuals ‚Äî and also serves as a playful reference to **Python Data Analysis**. üêº

---

### üßë‚Äçüíª A Brief History

- üìÖ **Wes McKinney** started developing what would later become Pandas during his time at AQR Capital (2007‚Äì2010).
- Pandas introduced into Python many features for working with **DataFrames** ‚Äî a concept that was already well-established in the R programming language.
- Pandas is built on top of another core library called **NumPy**, which provides high-performance array operations.

---

‚ú® In short:  
Pandas makes it **ridiculously easy** to work with tabular data ‚Äî something we‚Äôll do a lot in **Materials Science** and **Machine Learning**! üî¨ü§ñ

### üì¶ Installing Pandas

Let's first install the **Pandas** library (if it's not already installed).

In [1]:
# Installing the latest version of Pandas
!pip install pandas -q

In [2]:
# üì¶ Importing necessary libraries

import pandas as pd  # Pandas for data manipulation
import numpy as np    # NumPy for numerical operations

### üè∑Ô∏è Core Data Structures in Pandas

Pandas offers two primary classes for handling data:

1Ô∏è‚É£ **Series**  
A **one-dimensional** labeled array that can hold data of any type ‚Äî numbers, strings, Python objects, etc.

2Ô∏è‚É£ **DataFrame**  
A **two-dimensional** labeled data structure that holds data in rows and columns ‚Äî very similar to a spreadsheet or SQL table.

üìä These two classes form the foundation of almost everything you'll do with Pandas!

## üõ†Ô∏è Creating a Pandas Series

Let's create a simple **Series** containing the first 8 elements from the periodic table. üî¨

In [3]:
# Creating a Series of first 8 elements
elements_series = pd.Series(['H', 'He', 'Li', 'Be', 'B', 'C', 'N', 'O'])

# Display the Series
elements_series

0     H
1    He
2    Li
3    Be
4     B
5     C
6     N
7     O
dtype: object

## üß™ Creating a DataFrame of First 8 Elements with Their Atomic Number and Mass

In [4]:
# Defining element properties
elements = ['H', 'He', 'Li', 'Be', 'B', 'C', 'N', 'O']
atomic_numbers = [1, 2, 3, 4, 5, 6, 7, 8]
atomic_masses = [1.008, 4.003, 7.000, 9.012, 10.81, 12.011, 14.077, 15.999]

# Creating a NumPy array
periodic_table_array = np.array([elements, atomic_numbers, atomic_masses])

# Checking dimensions
print(f"Dimensions of periodic_table_array: {periodic_table_array.shape}")  
# Output: (3, 8) => 3 rows (attributes), 8 columns (elements)

# Transposing to switch rows to columns: (8, 3)
periodic_table_array.T

Dimensions of periodic_table_array: (3, 8)

array([['H', '1', '1.008'],
       ['He', '2', '4.003'],
       ['Li', '3', '7.0'],
       ['Be', '4', '9.012'],
       ['B', '5', '10.81'],
       ['C', '6', '12.011'],
       ['N', '7', '14.077'],
       ['O', '8', '15.999']], dtype='<U32')

üìå **Note:**  
We apply `.T` (transpose) because we want **rows as elements** and **columns as attributes** (Element, Atomic Number, Atomic Mass).

## üìä Creating a DataFrame from the Periodic Table Array

In [5]:
# Creating a DataFrame using the transposed periodic table array
periodic_table_df = pd.DataFrame(periodic_table_array.T, columns=['Element', 'Atomic Number', 'Atomic Mass'])

# Display the DataFrame
periodic_table_df

  Element Atomic Number Atomic Mass
0       H             1       1.008
1      He             2       4.003
2      Li             3         7.0
3      Be             4       9.012
4       B             5       10.81
5       C             6      12.011
6       N             7      14.077
7       O             8      15.999

## üëÄ Viewing the DataFrame

We can quickly peek into the data using the `.head(n)` function, which displays the first `n` rows of the DataFrame.

In [6]:
# Displaying the first 6 rows of the DataFrame
periodic_table_df.head(6)

  Element Atomic Number Atomic Mass
0       H             1       1.008
1      He             2       4.003
2      Li             3         7.0
3      Be             4       9.012
4       B             5       10.81
5       C             6      12.011

In [7]:
# Using tail(n) displays last 'n' entries in the dataframe

periodic_table_df.tail(2)

  Element Atomic Number Atomic Mass
6       N             7      14.077
7       O             8      15.999

In [8]:
# Using sample(n) displays any n entries in the dataframe

periodic_table_df.sample(3)

  Element Atomic Number Atomic Mass
5       C             6      12.011
6       N             7      14.077
3      Be             4       9.012

In [9]:
# Printing column names and index of the DataFrame
print(f'The column names of the DataFrame are: {periodic_table_df.columns}')
print(f'The index of the DataFrame is: {periodic_table_df.index}')

The column names of the DataFrame are: Index(['Element', 'Atomic Number', 'Atomic Mass'], dtype='object')
The index of the DataFrame is: RangeIndex(start=0, stop=8, step=1)

In [10]:
# Checking the data types of each column
periodic_table_df.dtypes

Element          object
Atomic Number    object
Atomic Mass      object
dtype: object

üìå **Note:**  
Currently, Pandas identifies all columns as type `object` (because the data was created from a NumPy array of mixed types).

üõ†Ô∏è Since `Atomic Number` and `Atomic Mass` are numerical values, we‚Äôll convert them into proper numeric types using `astype(float)` to allow mathematical operations.

## üîß Converting Columns to Numeric Types

In [11]:
# Selecting only the numeric columns and converting them to float
periodic_table_df_stat = periodic_table_df[['Atomic Number', 'Atomic Mass']].astype(float)

# Verifying the data types after conversion
periodic_table_df_stat.dtypes

Atomic Number    float64
Atomic Mass      float64
dtype: object

‚úÖ Now, both **Atomic Number** and **Atomic Mass** are correctly stored as `float64`, which allows us to perform numerical operations like statistics, sorting, filtering, etc.

## üìä Statistical Summary of the DataFrame

In [12]:
# Generating summary statistics for Atomic Number and Atomic Mass
periodic_table_df_stat.describe()

       Atomic Number  Atomic Mass
count        8.00000     8.000000
mean         4.50000     9.240000
std          2.44949     5.063674
min          1.00000     1.008000
25%          2.75000     6.250750
50%          4.50000     9.911000
75%          6.25000    12.527500
max          8.00000    15.999000

üìå **Note:**  
The `.describe()` function gives us a quick statistical overview of our numeric columns:

- `count` ‚ûî total number of entries  
- `mean` ‚ûî average value  
- `std` ‚ûî standard deviation (spread of data)  
- `min` ‚ûî minimum value  
- `25%`, `50%`, `75%` ‚ûî quartiles  
- `max` ‚ûî maximum value

Super useful for a quick sense-check of your data! ‚úÖ

## üîΩ Sorting the DataFrame in Descending Order by Atomic Number

In [13]:
# Sorting the DataFrame based on 'Atomic Number' in descending order
periodic_table_df_sort = periodic_table_df.sort_values(by='Atomic Number', ascending=False)

# Display the sorted DataFrame
periodic_table_df_sort

  Element Atomic Number Atomic Mass
7       O             8      15.999
6       N             7      14.077
5       C             6      12.011
4       B             5       10.81
3      Be             4       9.012
2      Li             3         7.0
1      He             2       4.003
0       H             1       1.008

üìå **Note:**  
- `sort_values()` helps you sort your DataFrame by any column.
- Setting `ascending=False` sorts it in descending order (largest value first).

## üîé Locating Entries in the DataFrame

We can use **`loc`** and **`iloc`** to access specific entries in the DataFrame:

- üìå **`loc[row_label, column_label]`**  
  ‚ûî Used when you want to select data by **labels** (i.e., row index name & column name).

- üìå **`iloc[row_index, column_index]`**  
  ‚ûî Used when you want to select data by **position** (i.e., integer-based row & column positions).

‚úÖ In both cases, we need two inputs:  
- The row (label or index)
- The column (label or index)

In [14]:
# Creating the DataFrame
materials_data = pd.DataFrame(
    [
        [5, 225],
        [1.46, 194],
        [0, 14],
        [0, 14],
        [np.nan, 225],
        [0, np.nan]
    ],
    index=['NaCl', 'MoS2', 'AgF2', 'Ag2Te', 'NbN', 'Nb3Sn'],
    columns=['band_gap', 'space_group_number']
)

# Display the DataFrame
materials_data

       band_gap  space_group_number
NaCl       5.00               225.0
MoS2       1.46               194.0
AgF2       0.00                14.0
Ag2Te      0.00                14.0
NbN         NaN               225.0
Nb3Sn      0.00                 NaN

## üîç Accessing Data Using `loc()`

We can access specific entries using their **row label** and **column name**.

In [15]:
# Accessing the band gap value of NaCl
materials_data.loc['NaCl', 'band_gap']

5.0

üìå **Explanation:**  
- `'NaCl'` is the **index (row label)**.
- `'band_gap'` is the **column name**.
- This directly retrieves the value stored at the intersection of that row and column.

## üîç Accessing Data Using `iloc()`

We can also access data using **integer-based indexing** with `iloc()`.

In [16]:
# Accessing the space_group_number of MoS2 using positional indexing
materials_data.iloc[1, 1]

194.0

üìå **Explanation:**  
- `iloc[1, 1]` means:  
   - Row at position `1` ‚Üí corresponds to **MoS2** (since indexing starts at 0).
   - Column at position `1` ‚Üí corresponds to **space_group_number**.
   
So, this returns the space group number for MoS2. ‚úÖ

In [17]:
# Accessing the band gap of NaCl using positional indexing
materials_data.iloc[0, 0]  # Output: 5 (before updating)

5.0

üìå **Note:**  
- Position indexing starts from `0` (not `1`).
- So `iloc[0, 0]` refers to the first row and first column of the DataFrame.

In [18]:
# Updating the band gap value of NaCl from 5 eV to 4.86 eV
materials_data.iloc[0, 0] = 4.86

# Display the updated DataFrame
materials_data

       band_gap  space_group_number
NaCl       4.86               225.0
MoS2       1.46               194.0
AgF2       0.00                14.0
Ag2Te      0.00                14.0
NbN         NaN               225.0
Nb3Sn      0.00                 NaN

In [19]:
# Selecting rows indexed 0 to 1 (inclusive of 0, exclusive of 2), and only the first column
materials_data.iloc[0:2, 0:1]

      band_gap
NaCl      4.86
MoS2      1.46

üìå **Note:**  
- `iloc[0:2, 0:1]` returns rows 0 and 1, and only the first column (`band_gap`).
- Remember: slicing works like `start:stop` where `stop` is exclusive.

## üö© Handling Missing Values

Let‚Äôs check if our `materials_data` DataFrame contains any missing values and then learn how to handle them.

In [20]:
# Checking for missing values
pd.isna(materials_data)

       band_gap  space_group_number
NaCl      False               False
MoS2      False               False
AgF2      False               False
Ag2Te     False               False
NbN        True               False
Nb3Sn     False                True

üìå **Note:**  
- `True` indicates a missing value (`NaN`) in that position.
- We will now handle these missing values by filling them with the **mean of their corresponding columns**.

In [21]:
# Attempt to fill NaN values with the mean of 'band_gap'
materials_data.fillna(value=materials_data['band_gap'].mean())

       band_gap  space_group_number
NaCl      4.860             225.000
MoS2      1.460             194.000
AgF2      0.000              14.000
Ag2Te     0.000              14.000
NbN       1.264             225.000
Nb3Sn     0.000               1.264

## üöÆ Correctly Dropping Missing Values

In [22]:
# Dropping rows where ANY column has a missing value
materials_data_clean = materials_data.dropna(how='any')

# Displaying the cleaned DataFrame
materials_data_clean

       band_gap  space_group_number
NaCl       4.86               225.0
MoS2       1.46               194.0
AgF2       0.00                14.0
Ag2Te      0.00                14.0

üìå **Explanation:**

- `how='any'` ‚ûî Drops a row **if any column** has a missing (`NaN`) value.
- `how='all'` ‚ûî Drops a row **only if all columns** have missing values.
- Use `axis=1` if you want to drop columns instead of rows.

‚ö†Ô∏è In real-world datasets, always analyze which strategy is appropriate before removing data!  
We don't want to accidentally lose useful information üî¨ü§ñ.

## üî¢ Using `value_counts()` for Quick Frequency Counts

In [23]:
# Count how many times each unique row appears
materials_data.value_counts()

band_gap  space_group_number
0.00      14.0                  2
1.46      194.0                 1
4.86      225.0                 1
dtype: int64

In [24]:
# Filtering rows where space_group_number equals 194 and then counting
materials_data[materials_data['space_group_number'] == 194].value_counts()

band_gap  space_group_number
1.46      194.0                 1
dtype: int64

üìå **Explanation:**

- `value_counts()` works on **rows** by default (when applied on a DataFrame).  
- The second example first filters rows where `space_group_number` is `194`, and then counts how many times each combination of values appears.

‚úÖ Very useful when analyzing duplicates or frequency of identical data entries!

## üîó Concatenation: Adding More Data to Our DataFrame

In [25]:
# Creating another DataFrame containing metal property and atomic number
mat_data = pd.DataFrame(
    [
        ['yes', 11],
        ['yes', 79],
        ['yes', 47],
        ['yes', 26]
    ],
    index=['Na', 'Au', 'Ag', 'Fe'],
    columns=['is_metal', 'atomic_number']
)

# Display the new DataFrame
mat_data

   is_metal  atomic_number
Na      yes             11
Au      yes             79
Ag      yes             47
Fe      yes             26

üìå **Note:**  
We have now created a second DataFrame `mat_data` containing information on:

- Whether the element is a metal (`is_metal`)
- Its atomic number (`atomic_number`)

This will allow us to practice **concatenation** operations next. üîßüêº

In [26]:
# Creating a second DataFrame to concatenate
mat_data_1 = pd.DataFrame(
    [
        ['no', 5],
        ['no', 16],
        ['no', 36],
        ['yes', 55]
    ],
    index=['B', 'S', 'Kr', 'Cs'],
    columns=['is_metal', 'atomic_number']
)
mat_data_1

   is_metal  atomic_number
B        no              5
S        no             16
Kr       no             36
Cs      yes             55

## üîó Concatenating DataFrames by Rows and Columns

In [27]:
# Concatenating the two DataFrames along rows (stacking one below another)
concat_row = pd.concat([mat_data, mat_data_1], axis=0)
concat_row

   is_metal  atomic_number
Na      yes             11
Au      yes             79
Ag      yes             47
Fe      yes             26
B        no              5
S        no             16
Kr       no             36
Cs      yes             55

In [28]:
# Concatenating the two DataFrames along columns (side-by-side)
concat_columns = pd.concat([mat_data, mat_data_1], axis=1)
concat_columns

   is_metal  atomic_number is_metal  atomic_number
Na      yes           11.0      NaN            NaN
Au      yes           79.0      NaN            NaN
Ag      yes           47.0      NaN            NaN
Fe      yes           26.0      NaN            NaN
B       NaN            NaN       no            5.0
S       NaN            NaN       no           16.0
Kr      NaN            NaN       no           36.0
Cs      NaN            NaN      yes           55.0

üìå **Explanation:**

- `axis=0` ‚ûî Stacks DataFrames vertically (rows added).  
- `axis=1` ‚ûî Stacks DataFrames horizontally (columns added).  
- When indexes don't match, Pandas automatically aligns them and fills missing values with `NaN`.

‚úÖ Be cautious when merging on `axis=1` ‚Äî matching indexes are essential to avoid unintended `NaN` entries.


## üìö Some Useful Resources to Learn Pandas Further

1Ô∏è‚É£ [**Complete Python Pandas Data Science Tutorial!** (2025 Updated Edition)
](https://www.youtube.com/watch?v=2uvysYbKdjM)  
A beginner-friendly crash course that covers the basics of Python in just over an hour.